PorousMediaWithMultphase/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type    explicitPorositySource;
    active  yes;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        porousCells;  // Certifique-se de que o nome da zona está correto

        type            DarcyForchheimer;
        D               500;  // Exemplo de permeabilidade

        DarcyForchheimerCoeffs
        {
            d   ($D $D $D);
            f   (0 0 0);
            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation
                {
                    type    axesRotation;
                    e1  (1 0 0);
                    e2  (0 1 0);
                }
            }
        }
    }
}
