PorousMediaWithMultphase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    porousCellSet; 
        type    cellSet;
        action  new;
        
        source  boxToCell;
        sourceInfo
        {
            box (0.01 0 -0.1) (0.1 0.02 0.1);
        }
    }
    {
        name    porousCells;
        type    cellZoneSet;
        action  new;
        
        source  setToCellZone;
        sourceInfo
        {
            set porousCellSet;
        }
    }
);

